///=======================================
/// <summary>
/// JS 공통함수
/// </summary>
///=======================================

//--------------------------------------
//숫자 입력 시 천단위 콤마
//--------------------------------------
inputNumberFormat = function (obj) {
    obj.value = comma(uncomma(obj.value));
}

//--------------------------------------
//콤마찍기
//--------------------------------------
comma = function (str) {
    str = String(str);
    return str.replace(/(\d)(?=(?:\d{3})+(?!\d))/g, '$1,');
}

//--------------------------------------
//콤마풀기
//--------------------------------------
uncomma = function (str) {
    str = String(str);
    return str.replace(/[^\d]+/g, '');
}